app/controllers/xml_parses_controller.rb

	def show
		@xml_parse = XmlParse.find(params[:id])
---
SELECT  "xml_parses".* FROM "xml_parses" WHERE "xml_parses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
		@xml_parse = XmlParse.new(xml_parse_params)

		@xml_parse.save
---
INSERT INTO "xml_parses" ("xml_url", "created_at", "updated_at") VALUES (?, ?, ?)  [["xml_url", "http://www.ibiblio.org/xml/examples/shakespeare/macbeth.xml"], ["created_at", "2017-07-10 20:28:34.549756"], ["updated_at", "2017-07-10 20:28:34.549756"]]